Interface.Post.Goods.Issue.PWS.To.CDM/Interface.Linfox.PGI.PWSToCDM.Tests/TestData/In/DGI - CDM To Belkin - Q2Q Basic Test.xml

<SOAP-ENV:Envelope SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" 
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" 
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema">
    <SOAP-ENV:Header></SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <ns1:PostGoodsIssue 
            xmlns:ns1="http://linfoxintegration.com/horizon/postgoodsissue/1.0">
            <ns1:MessageHeader>
                <ns1:ID>PICKS00501</ns1:ID>
                <ns1:CreationDate>2017-03-22T13:36:45</ns1:CreationDate>
                <ns1:GLNCode>22868</ns1:GLNCode>
                <ns1:CustomerName>228682</ns1:CustomerName>
                <ns1:WarehouseLocationCode>NSW1</ns1:WarehouseLocationCode>
                <ns1:TestIndicator>T</ns1:TestIndicator>
            </ns1:MessageHeader>
            <ns1:GIHeader>
                <ns1:LfxShpOdrNbr>2286861349673</ns1:LfxShpOdrNbr>
                <ns1:PrmCustShpOdrNbr>2286861349673</ns1:PrmCustShpOdrNbr>
                <ns1:SalesOrderNumber>23693791</ns1:SalesOrderNumber>
                <ns1:CustPONbr>14473815</ns1:CustPONbr>
                <ns1:ConNoteNumber>STAR000121</ns1:ConNoteNumber>
                <ns1:TrackingURL/>
                <ns1:AddnRefDetails1/>
                <ns1:AddnRefDetails2/>
                <ns1:AddnRefDetails3/>
                <ns1:TransportProvider>STAR</ns1:TransportProvider>
                <ns1:TransportProviderName>Startrack</ns1:TransportProviderName>
                <ns1:ShipSrvCode>LT</ns1:ShipSrvCode>
                <ns1:TotalPalletsCount>1</ns1:TotalPalletsCount>
                <ns1:TotalCaseCount>2</ns1:TotalCaseCount>
                <ns1:TotalShipWeight>1.3822</ns1:TotalShipWeight>
                <ns1:TotalShipWeightUOM>KG</ns1:TotalShipWeightUOM>
            </ns1:GIHeader>
            <ns1:GIItemLevel>
                <ns1:GIItem>
                    <ns1:ShpOdrLineItemNo>4589</ns1:ShpOdrLineItemNo>
                    <ns1:LfxShpOdrLineItemNo>1</ns1:LfxShpOdrLineItemNo>
                    <ns1:AddnRefDetails1/>
                    <ns1:AddnRefDetails2/>
                    <ns1:AddnRefDetails3/>
                    <ns1:AddnRefDetails4/>
                    <ns1:AddnRefDetails5/>
                    <ns1:MaterialCode>22868F2CD079BT</ns1:MaterialCode>
                    <ns1:GTINCode>2286810745883696991</ns1:GTINCode>
                    <ns1:MaterialName>ADAPTER,DSPLYPRT,MINI DISPLAYPORT TO HDMI, 4K</ns1:MaterialName>
                    <ns1:OrderQuantity>4</ns1:OrderQuantity>
                    <ns1:BaseUOM>EA</ns1:BaseUOM>
                    <ns1:BackOrderQuantity>0</ns1:BackOrderQuantity>
                    <ns1:StockCategoryType></ns1:StockCategoryType>
                    <ns1:PGIQuantity>4</ns1:PGIQuantity>
                </ns1:GIItem>
                <ns1:GIItem>
                    <ns1:ShpOdrLineItemNo>4589</ns1:ShpOdrLineItemNo>
                    <ns1:LfxShpOdrLineItemNo>2</ns1:LfxShpOdrLineItemNo>
                    <ns1:AddnRefDetails1/>
                    <ns1:AddnRefDetails2/>
                    <ns1:AddnRefDetails3/>
                    <ns1:AddnRefDetails4/>
                    <ns1:AddnRefDetails5/>
                    <ns1:MaterialCode>22868A3L980AU05</ns1:MaterialCode>
                    <ns1:GTINCode></ns1:GTINCode>
                    <ns1:MaterialName></ns1:MaterialName>
                    <ns1:OrderQuantity>6</ns1:OrderQuantity>
                    <ns1:BaseUOM></ns1:BaseUOM>
                    <ns1:BackOrderQuantity>0</ns1:BackOrderQuantity>
                    <ns1:StockCategoryType></ns1:StockCategoryType>
                    <ns1:PGIQuantity>6</ns1:PGIQuantity>
                </ns1:GIItem>
            </ns1:GIItemLevel>
            <ns1:HandlingUnitDetails>
                <ns1:HandlingUnitDetail>
                    <ns1:ParentHU>393228681000004792</ns1:ParentHU>
                    <ns1:ParentHUWeight>1</ns1:ParentHUWeight>
                    <ns1:ParentHUType></ns1:ParentHUType>
                    <ns1:HUNumber>333333333333112911</ns1:HUNumber>
                    <ns1:HUType></ns1:HUType>
                    <ns1:HUWeight>0</ns1:HUWeight>
                    <ns1:WeightUOM>KG</ns1:WeightUOM>
                    <ns1:HULineItem>
                        <ns1:ShipOrderLineItemNo>45892429</ns1:ShipOrderLineItemNo>
                        <ns1:LfxShpOdrLineItemNo>2</ns1:LfxShpOdrLineItemNo>
                        <ns1:AddnRefDetails1/>
                        <ns1:AddnRefDetails2/>
                        <ns1:MaterialCode>22868A3L980AU05M-BLS</ns1:MaterialCode>
                        <ns1:PGIQuantity>6</ns1:PGIQuantity>
                        <ns1:UOM>EA</ns1:UOM>
                        <ns1:BatchDetails>
                            <ns1:Batch>
                                <ns1:BatchCode>7058</ns1:BatchCode>
                                <ns1:SLEDorBBD>2019-09-02</ns1:SLEDorBBD>
                                <ns1:Quantity>6</ns1:Quantity>
                                <ns1:UOM>EA</ns1:UOM>
                            </ns1:Batch>
                        </ns1:BatchDetails>
                    </ns1:HULineItem>
                </ns1:HandlingUnitDetail>
                <ns1:HandlingUnitDetail>
                    <ns1:ParentHU>393228681000004792</ns1:ParentHU>
                    <ns1:ParentHUWeight>0</ns1:ParentHUWeight>
                    <ns1:ParentHUType>O</ns1:ParentHUType>
                    <ns1:HUNumber>393228684000084764</ns1:HUNumber>
                    <ns1:HUType>O</ns1:HUType>
                    <ns1:HUWeight>1</ns1:HUWeight>
                    <ns1:WeightUOM>KG</ns1:WeightUOM>
                    <ns1:HULineItem>
                        <ns1:ShipOrderLineItemNo>45892428</ns1:ShipOrderLineItemNo>
                        <ns1:LfxShpOdrLineItemNo>1</ns1:LfxShpOdrLineItemNo>
                        <ns1:AddnRefDetails1/>
                        <ns1:AddnRefDetails2/>
                        <ns1:MaterialCode>22868F2CD079BT</ns1:MaterialCode>
                        <ns1:PGIQuantity>4</ns1:PGIQuantity>
                        <ns1:UOM>EA</ns1:UOM>
                        <ns1:BatchDetails>
                            <ns1:Batch>
                                <ns1:BatchCode>7058</ns1:BatchCode>
                                <ns1:SLEDorBBD>2019-09-02</ns1:SLEDorBBD>
                                <ns1:Quantity>4</ns1:Quantity>
                                <ns1:UOM>EA</ns1:UOM>
                            </ns1:Batch>
                        </ns1:BatchDetails>
                    </ns1:HULineItem>
                </ns1:HandlingUnitDetail>
            </ns1:HandlingUnitDetails>
        </ns1:PostGoodsIssue>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>